import telebot
import random

bot = telebot.TeleBot("TOKEN)")

@bot.message_handler(commands=['start'])
def send_welcome(message):
    bot.send_message(message.chat.id, 'I hear you')

# TASK1
pasta1 = 'Только что забанил долбоеба в предложке (он потом со второго акка написал, но я даже не начав читать сразу и его забанил), но думаю надо действительно прояснить этот момент (долбоёб писал, что я плохой, потому что захейтил оппозиционера).Оппозиционер - понятия невероятно размытое. Вот Кац, вроде бы, оппозиционер с одной стороны - говорит гадости про власть, а с другой - вся его риторика за все время его деятельности сводилась к тому, что надо мирно протестовать, ходить на ни на что не влияющие выборы и терпеть, что как бы не очень оппозиционно. А потому пользоваться риторикой \"ты захейтил оппозиционера, значит ты плохой\" может, в лучшем случае, только 14-летний подросток без мозгов (который еще и с других аккаунтов тебе будет писать, думая, что это заставит тебя читать его шизо-простыни на сотни букв).'
pasta2 = 'Американо-российский мир:\n\n- Перепровести в Калифорнии и Техасе выборы под присмотром ООН. США уходит оттуда, если на то воля людей.\n\n- Аляска формально - часть РФ, как это было с 1799 года (до ошибки Александра II)\n\n- Водоснабжение в Аляску гарантируется\n\n- США становятся нейтральным государством'
pasta3 = 'Бля хлопці нам тепер доторкатися до жінок У БУДЬ-ЯКІЙ ситуції не можна, бо це можна трактувати, як насильство. Бля начебто ми в футбол граємо, а роздувать з мухи бомбальдувальник дівчата. А жовту картку всеодно нам. До речі приклад: якщо хлопець назове дівчину шаболдою, курвою і тп вона дасть йому ляпаса і всі її підримають; якщо в ситуації змінити ролі, то за дії чоловіка його будуть засуджувати - це рівноправ\'я. І тільки скажіть, що це не так, можливо ви вважаєте, що в житті всі такі добрі гарні і є тільки добро та зло. (Бля навіть чорне біле сказати не можна забанять) Але ні в житті жінки користуються і тим і тим, який погляд більш вигідніший на данний момент. Він цього мене нудить він вашого рівноправ\'я. Мене оскорбили, обматирели, за те що я висловив думку, де ж ваша грьобана свобода вибора і слова? Чи мені вже не думати, бо це оскорбляє дурних? Я не разу не сказав, що бити жінок добре, заранєє вибачився, висловив думку, в ітозі хейт. Я жіноненавистник, мостр та твар, бо у у конкретній ситуації підтримав іншу сторону'
pasta4 = 'От сорі, чувак, я маю працювати, тому це буде моє мабуть ласт повідомлення, якщо я не побачу тут ще більшої купи лайна, але твоя аргументація звучить 1в1 як «хороших руських» на початку війни. Ти літєралі говориш фразами «ми не знаем всей картиньі» і «всьо не так однозначно»\n\nНасильство - погано, тільки якщо це не самозахист. ВСЕ. НЕМАЄ НО, АЛЕ, А ЯКЩО і іншого. НАСИЛЬСТВО ПОГАНО! Гот іт? Друже. Тобі чітко намагаються дати зрозуміти, що те що на відосі НЕПРИЙНЯТНО. Ставлення до цього(як до ситуації) МАЄ БУТИ НЕГАТИВНЕ, якщо ти вважаєш себе хоч на 70% розумним або інтелгентним. Я все сказав. З Іллєю тобі краще не знайомитись, особиста порада.'
pasta5 = 'Базовый рецепт пасты\n\n Доведите до кипения большую кастрюлю подсоленной воды. Добавьте 450 гр. макарон и готовьте, как указано на упаковке, периодически помешивая. Тем временем приготовьте понравившийся соус в большой сковороде. Сохраните 1 ст. варочной воды, затем откиньте пасту на дуршлаг. Добавьте в сковороду с соусом, при необходимости разбавляя его оставшейся водой после варки.'
pastaArr = [pasta1, pasta2, pasta3, pasta4, pasta5]
pastaArrLen = len(pastaArr)-1

@bot.message_handler(commands=['sendPasta'])
def send_pasta(message):
    bot.send_message(message.chat.id, pastaArr[random.randint(0, pastaArrLen)])

# TASK2
@bot.message_handler(commands=['sendPic'])
def send_picture(message):
    randomPic = f'https://picsum.photos/id/{random.randint(1, 1100)}/300/300'
    bot.send_photo(message.chat.id, randomPic)

bot.infinity_polling()


